package org.example;

public class PracticeOutputPoint {

    /**
     * Розумію, що доки пишуться англійською, але не став на це витрачати час, адже українською швидше, і не було таких вимог.
     * Також, в свій час писав чимало технічних документів суто українською, що на мою думку вплинуло на якість
     * описання алгоритму та інших моментів виконання ТЗ
     */
    public static void main(String[] args) {

        //e.g. швидкість 41.74 // 150,3 км/год

        //1 Створюємо ЛА з відповідними х-ками (e.g. 3 шт, згідно ТЗ)
        //1.1  Отримуємо від Штабу список польотів з конкретними даними маршруту List<Flight> flights
        //1.2 Якщо ЛА вже в польоті сетапимо йому останню точку, в якій він перебував до отримання нових польотів
        //1.3 Якщо це старт (ЛА на запусковому майданичку) сетапимо дані локаії цієї позиції

        //2 Далі циклом по цих трьох ЛА викликаємо наш calculate через RouteCalculator
        //2.1 Результатом роботи буде список проміжних точок для кожного з ЛА, які долає при виконанні маршруту flights
    }
}